000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ИнформативныеОстаткиТоваровПоМагазинам/ИнформативныеОстаткиТоваровПоМагазинам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформативныеОстаткиТоваровПоМагазинам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыДляОбработки/ОбъектыДляОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыДляОбработки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>IDN</name>
    <comment>Идентификатор объекта в Navision (или другая информация)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействиеКоманда</name>
    <comment>Задается литерально для облегчения использования в коде</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объект</name>
    <comment>Некторый объект</comment>
    <type>
      <types>Date</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <resources>
    <name>Хранилище</name>
    <comment>Любая другая дополнительная информация, назначенная для обработки командой</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <comment>Пустой - по всем магазинам</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <comment>Во избежание случайных совпадений</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ИнформативныеОстаткиТоваровПоМагазинам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВыполнениеСверкиИнформативныхОстатковПоУзламВРазрезеМагазинов
	
//	LNK 05.04.2017 09:29:35
Процедура ЗапроситьСверкуИнформативныеОстаткиТоваровПоМагазинам(Магазин = Неопределено)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если Магазин = Неопределено Тогда

		Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

			ВызватьИсключение "Сверка может быть запрошена только в перферийном узле «Магазины»! Запрос на сверку прерван.";

		КонецЕсли;

		Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

		Если НЕ ЗначениеЗаполнено(Магазин) Тогда

			ВызватьИсключение "Магазин текущего узла не определён! Запрос на сверку прерван.";

		КонецЕсли;

	КонецЕсли;

//	Ликвидируем возможные какие "отпечатки" прошлого в периферии - достали уже в магазинах
//	смотреть свои остатки по этому регистру!
	ОчиститьИнформативныеОстаткиТекущегоМагазинаВПериферии(Магазин);

	УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику();

	Если УчетнаяПолитика.ВыполнятьСверкуИнформативныхОстатков = Истина Тогда

		ВремяНачала    = ТекущаяДатаСеанса();
		СобытиеЖурнала = "Запрос сверки информационных остатков";
		ЖурналСобытий.Регистрация(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение
			, "РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам"
			, Магазин
			,
			, "НАЧАЛО [" + ВремяНачала + "]"
			,
			, Истина
		);

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаРегистра.Магазин,
		|	ТаблицаРегистра.Номенклатура,
		|	ТаблицаРегистра.Количество
		|ИЗ
		|	РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам КАК ТаблицаРегистра
		|ГДЕ
		|	НЕ ТаблицаРегистра.Магазин = &Магазин"
		);
		Запрос.УстановитьПараметр("Магазин", Магазин);
		
		ТаблицаДанных = Запрос.Выполнить().Выгрузить();
		ВнешниеИсточникиСобытия.УстановитьОбъектДляОбработки("", "СВЕРИТЬ_ИНФ_ОСТАТКИ",, Новый ХранилищеЗначения(ТаблицаДанных, Новый СжатиеДанных(9)));

		ЖурналСобытий.Регистрация(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение, "РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам", Магазин
		,, "КОНЕЦ [" + ВремяНачала + "], размер таблицы = " + Формат(ТаблицаДанных.Количество(), "ЧН=0; ЧГ=") + " строк",, Истина);

	КонецЕсли;

КонецПроцедуры

//	LNK 05.04.2017 10:41:20
Процедура ВыполнитьСверкуИнформативныеОстаткиТоваровПоМагазинам()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		ВызватьИсключение "Сверка может быть выполнена только в ЦБ «Магазины»! Выполнение сверки прервано.";

	КонецЕсли;

	УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику();

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Магазин,
	|	ТаблицаРегистра.Магазин.НомерМагазина КАК НомерМагазина,
	|	ТаблицаРегистра.Хранилище,
	|	ТаблицаРегистра.Индекс КАК Индекс
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбработки КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ДействиеКоманда = ""СВЕРИТЬ_ИНФ_ОСТАТКИ""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	НомерМагазина,
	|	Индекс"
	);
	СверкиВыборка = Запрос.Выполнить().Выбрать();

	Пока СверкиВыборка.Следующий() Цикл

		Если УчетнаяПолитика.ВыполнятьСверкуИнформативныхОстатков = Истина Тогда

			СверитьИнформативныеОстатки(СверкиВыборка.Магазин
									, ОбменДаннымиПовтИсп.ПолучитьСписокУзловДляМагазина(СверкиВыборка.Магазин)
									, СверкиВыборка.Хранилище.Получить()
			);

		КонецЕсли;

		МенеджерЗаписи = РегистрыСведений.ОбъектыДляОбработки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СверкиВыборка);
		МенеджерЗаписи.Удалить();

	КонецЦикла;

КонецПроцедуры

//	LNK 05.04.2017 10:47:10
Процедура СверитьИнформативныеОстатки(Магазин, СписокУзлов, ТаблицаДанных)

	ВремяНачала    = ТекущаяДатаСеанса();
	СобытиеЖурнала = "Сверка информационных остатков";
	ЖурналСобытий.Регистрация(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение, "РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам", Магазин
	,, "НАЧАЛО [" + ВремяНачала + "], размер таблицы = " + Формат(ТаблицаДанных.Количество(), "ЧН=0; ЧГ=") + " строк",, Истина);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаДанных.Магазин КАК Справочник.Магазины) КАК Магазин,
	|	ВЫРАЗИТЬ(ТаблицаДанных.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаДанных.Количество
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.Магазин <> &Магазин
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Магазин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Магазин,
	|	Данные.Номенклатура
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам КАК ТаблицаРегистра
	|		ПО Данные.Магазин = ТаблицаРегистра.Магазин
	|			И Данные.Номенклатура = ТаблицаРегистра.Номенклатура
	|ГДЕ
	|	ТаблицаРегистра.Количество ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Данные.Магазин,
	|	Данные.Номенклатура
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам КАК ТаблицаРегистра
	|		ПО Данные.Магазин = ТаблицаРегистра.Магазин
	|			И Данные.Номенклатура = ТаблицаРегистра.Номенклатура
	|ГДЕ
	|	Данные.Количество <> ТаблицаРегистра.Количество
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Магазин,
	|	ТаблицаРегистра.Номенклатура
	|ИЗ
	|	РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам КАК ТаблицаРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
	|		ПО ТаблицаРегистра.Магазин = Данные.Магазин
	|			И ТаблицаРегистра.Номенклатура = Данные.Номенклатура
	|ГДЕ
	|	ТаблицаРегистра.Магазин <> &Магазин
	|	И Данные.Количество ЕСТЬ NULL "
	);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);

	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.ИнформативныеОстаткиТоваровПоМагазинам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Характеристика.Установить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	ЖурналСобытий.Регистрация(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение, "РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам", Магазин
	,, "Время выборки [" + ОбщегоНазначенияКлиентСервер.ВРЕМЯ(ТекущаяДатаСеанса() - ВремяНачала) + "], размер выборки = " + Формат(Выборка.Количество(), "ЧН=0; ЧГ=") + " строк",, Истина);

	Пока Выборка.Следующий() Цикл

		НаборЗаписей.Отбор.Магазин.Установить(Выборка.Магазин);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);

		Для каждого Узел Из СписокУзлов Цикл

			Если НЕ ПланыОбмена.ИзменениеЗарегистрировано(Узел, НаборЗаписей) Тогда

				ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	ЖурналСобытий.Регистрация(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение, "РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам", Магазин
	,, "КОНЕЦ - общее время [" + ОбщегоНазначенияКлиентСервер.ВРЕМЯ(ТекущаяДатаСеанса() - ВремяНачала) + "]",, Истина);

КонецПроцедуры

//	LNK 05.07.2017 13:50:18
Процедура ОчиститьИнформативныеОстаткиТекущегоМагазинаВПериферии(Магазин)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Возврат;

	КонецЕсли;

//	Ликвидируем возможные какие "отпечатки" прошлого в периферии - достали уже в магазинах
//	смотреть свои остатки по этому регистру!

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Магазин,
	|	ТаблицаРегистра.Номенклатура,
	|	ТаблицаРегистра.Характеристика
	|ИЗ
	|	РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Магазин = &Магазин"
	);
	Запрос.УстановитьПараметр("Магазин", Магазин);

	НаборЗаписей = РегистрыСведений.ИнформативныеОстаткиТоваровПоМагазинам.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения"  , Истина);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		НаборЗаписей.Отбор.Магазин.Установить(Выборка.Магазин);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика);

		НаборЗаписей.Записать();

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
